; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l5-t1-p7---int100n150-m25---int100c110---s90---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 - fuellevel
)

(:init
(sum level0 level2 level2)
(sum level0 level3 level3)
(sum level0 level11 level11)
(sum level0 level21 level21)
(sum level0 level22 level22)
(sum level1 level2 level3)
(sum level1 level3 level4)
(sum level1 level11 level12)
(sum level1 level21 level22)
(sum level1 level22 level23)
(sum level2 level2 level4)
(sum level2 level3 level5)
(sum level2 level11 level13)
(sum level2 level21 level23)
(sum level2 level22 level24)
(sum level3 level2 level5)
(sum level3 level3 level6)
(sum level3 level11 level14)
(sum level3 level21 level24)
(sum level3 level22 level25)
(sum level4 level2 level6)
(sum level4 level3 level7)
(sum level4 level11 level15)
(sum level4 level21 level25)
(sum level4 level22 level26)
(sum level5 level2 level7)
(sum level5 level3 level8)
(sum level5 level11 level16)
(sum level5 level21 level26)
(sum level5 level22 level27)
(sum level6 level2 level8)
(sum level6 level3 level9)
(sum level6 level11 level17)
(sum level6 level21 level27)
(sum level6 level22 level28)
(sum level7 level2 level9)
(sum level7 level3 level10)
(sum level7 level11 level18)
(sum level7 level21 level28)
(sum level7 level22 level29)
(sum level8 level2 level10)
(sum level8 level3 level11)
(sum level8 level11 level19)
(sum level8 level21 level29)
(sum level8 level22 level30)
(sum level9 level2 level11)
(sum level9 level3 level12)
(sum level9 level11 level20)
(sum level9 level21 level30)
(sum level9 level22 level31)
(sum level10 level2 level12)
(sum level10 level3 level13)
(sum level10 level11 level21)
(sum level10 level21 level31)
(sum level10 level22 level32)
(sum level11 level2 level13)
(sum level11 level3 level14)
(sum level11 level11 level22)
(sum level11 level21 level32)
(sum level11 level22 level33)
(sum level12 level2 level14)
(sum level12 level3 level15)
(sum level12 level11 level23)
(sum level12 level21 level33)
(sum level12 level22 level34)
(sum level13 level2 level15)
(sum level13 level3 level16)
(sum level13 level11 level24)
(sum level13 level21 level34)
(sum level13 level22 level35)
(sum level14 level2 level16)
(sum level14 level3 level17)
(sum level14 level11 level25)
(sum level14 level21 level35)
(sum level14 level22 level36)
(sum level15 level2 level17)
(sum level15 level3 level18)
(sum level15 level11 level26)
(sum level15 level21 level36)
(sum level15 level22 level37)
(sum level16 level2 level18)
(sum level16 level3 level19)
(sum level16 level11 level27)
(sum level16 level21 level37)
(sum level16 level22 level38)
(sum level17 level2 level19)
(sum level17 level3 level20)
(sum level17 level11 level28)
(sum level17 level21 level38)
(sum level17 level22 level39)
(sum level18 level2 level20)
(sum level18 level3 level21)
(sum level18 level11 level29)
(sum level18 level21 level39)
(sum level19 level2 level21)
(sum level19 level3 level22)
(sum level19 level11 level30)
(sum level20 level2 level22)
(sum level20 level3 level23)
(sum level20 level11 level31)
(sum level21 level2 level23)
(sum level21 level3 level24)
(sum level21 level11 level32)
(sum level22 level2 level24)
(sum level22 level3 level25)
(sum level22 level11 level33)
(sum level23 level2 level25)
(sum level23 level3 level26)
(sum level23 level11 level34)
(sum level24 level2 level26)
(sum level24 level3 level27)
(sum level24 level11 level35)
(sum level25 level2 level27)
(sum level25 level3 level28)
(sum level25 level11 level36)
(sum level26 level2 level28)
(sum level26 level3 level29)
(sum level26 level11 level37)
(sum level27 level2 level29)
(sum level27 level3 level30)
(sum level27 level11 level38)
(sum level28 level2 level30)
(sum level28 level3 level31)
(sum level28 level11 level39)
(sum level29 level2 level31)
(sum level29 level3 level32)
(sum level30 level2 level32)
(sum level30 level3 level33)
(sum level31 level2 level33)
(sum level31 level3 level34)
(sum level32 level2 level34)
(sum level32 level3 level35)
(sum level33 level2 level35)
(sum level33 level3 level36)
(sum level34 level2 level36)
(sum level34 level3 level37)
(sum level35 level2 level37)
(sum level35 level3 level38)
(sum level36 level2 level38)
(sum level36 level3 level39)
(sum level37 level2 level39)

(connected l0 l1)
(fuelcost level2 l0 l1)
(connected l0 l3)
(fuelcost level11 l0 l3)
(connected l1 l0)
(fuelcost level2 l1 l0)
(connected l1 l2)
(fuelcost level21 l1 l2)
(connected l1 l3)
(fuelcost level21 l1 l3)
(connected l2 l1)
(fuelcost level21 l2 l1)
(connected l2 l3)
(fuelcost level22 l2 l3)
(connected l2 l4)
(fuelcost level2 l2 l4)
(connected l3 l0)
(fuelcost level11 l3 l0)
(connected l3 l1)
(fuelcost level21 l3 l1)
(connected l3 l2)
(fuelcost level22 l3 l2)
(connected l3 l4)
(fuelcost level3 l3 l4)
(connected l4 l2)
(fuelcost level2 l4 l2)
(connected l4 l3)
(fuelcost level3 l4 l3)

(at t0 l2)
(fuel t0 level39)
(= (total-cost) 0)

(at p0 l0)
(at p1 l1)
(at p2 l0)
(at p3 l1)
(at p4 l2)
(at p5 l1)
(at p6 l3)
)

(:goal
(and
(at p0 l4)
(at p1 l2)
(at p2 l1)
(at p3 l0)
(at p4 l0)
(at p5 l2)
(at p6 l2)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p4 t0 l2)
   deleted: (at p4 l2)
   added: (in p4 t0)
   goals met: 0 of 7
2. (drive t0 l2 l4 level37 level2 level39)
   deleted: (at t0 l2) (fuel t0 level39)
   added: (at t0 l4) (fuel t0 level37)
   goals met: 0 of 7
3. (drive t0 l4 l3 level34 level3 level37)
   deleted: (at t0 l4) (fuel t0 level37)
   added: (at t0 l3) (fuel t0 level34)
   goals met: 0 of 7
4. (load p6 t0 l3)
   deleted: (at p6 l3)
   added: (in p6 t0)
   goals met: 0 of 7
5. (drive t0 l3 l0 level23 level11 level34)
   deleted: (at t0 l3) (fuel t0 level34)
   added: (at t0 l0) (fuel t0 level23)
   goals met: 0 of 7
6. (unload p4 t0 l0)
   deleted: (in p4 t0)
   added: (at p4 l0)
   goals met: 1 of 7
7. (load p2 t0 l0)
   deleted: (at p2 l0)
   added: (in p2 t0)
   goals met: 1 of 7
8. (load p0 t0 l0)
   deleted: (at p0 l0)
   added: (in p0 t0)
   goals met: 1 of 7
9. (drive t0 l0 l1 level21 level2 level23)
   deleted: (at t0 l0) (fuel t0 level23)
   added: (at t0 l1) (fuel t0 level21)
   goals met: 1 of 7
10. (load p1 t0 l1)
   deleted: (at p1 l1)
   added: (in p1 t0)
   goals met: 1 of 7
11. (load p3 t0 l1)
   deleted: (at p3 l1)
   added: (in p3 t0)
   goals met: 1 of 7
12. (load p5 t0 l1)
   deleted: (at p5 l1)
   added: (in p5 t0)
   goals met: 1 of 7
13. (unload p2 t0 l1)
   deleted: (in p2 t0)
   added: (at p2 l1)
   goals met: 2 of 7
14. (drive t0 l1 l0 level19 level2 level21)
   deleted: (at t0 l1) (fuel t0 level21)
   added: (at t0 l0) (fuel t0 level19)
   goals met: 2 of 7
15. (unload p3 t0 l0)
   deleted: (in p3 t0)
   added: (at p3 l0)
   goals met: 3 of 7
16. (drive t0 l0 l3 level8 level11 level19)
   deleted: (at t0 l0) (fuel t0 level19)
   added: (at t0 l3) (fuel t0 level8)
   goals met: 3 of 7
17. (drive t0 l3 l4 level5 level3 level8)
   deleted: (at t0 l3) (fuel t0 level8)
   added: (at t0 l4) (fuel t0 level5)
   goals met: 3 of 7
18. (unload p0 t0 l4)
   deleted: (in p0 t0)
   added: (at p0 l4)
   goals met: 4 of 7
19. (drive t0 l4 l2 level3 level2 level5)
   deleted: (at t0 l4) (fuel t0 level5)
   added: (at t0 l2) (fuel t0 level3)
   goals met: 4 of 7
20. (unload p1 t0 l2)
   deleted: (in p1 t0)
   added: (at p1 l2)
   goals met: 5 of 7
21. (unload p5 t0 l2)
   deleted: (in p5 t0)
   added: (at p5 l2)
   goals met: 6 of 7
22. (unload p6 t0 l2)
   deleted: (in p6 t0)
   added: (at p6 l2)
   goals met: 7 of 7
